//=============================================================================
//
// メッシュフィールド処理 [meshField.h]
// Author : 竹内亘
//
//=============================================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitmeshField(void);
void UninitmeshField(void);
void UpdatemeshField(void);
void DrawmeshField(void);

#endif
