//=============================================================================
//
// リザルトロゴ2(ゲームオーバー)処理 [resultlogo2.h]
// Author : 竹内亘
//
//=============================================================================
#ifndef _RESULTLOGO2_H_
#define _RESULTLOGO2_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResultLogo2(void);
void UninitResultLogo2(void);
void UpdateResultLogo2(void);
void DrawResultLogo2(void);

#endif