//=============================================================================
//
// チュートリアルロゴの処理 [tutorialLogo.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "settai.h"
#include "renderer.h"
#include "game.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CSettai::m_pTexture = NULL;

//=============================================================================
// チュートリアルロゴの生成処理
//=============================================================================
CSettai *CSettai::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CSettai *pSettai = NULL;

	if (pSettai == NULL)
	{
		// チュートリアルロゴクラスの生成
		pSettai = new CSettai;

		if (pSettai != NULL)
		{
			pSettai->SetPosition(pos);
			pSettai->SetWidth(fWidth);
			pSettai->SetHeight(fHeight);
			pSettai->Init();
			pSettai->BindTexture(m_pTexture);
		}
	}

	return pSettai;
}

//=============================================================================
// チュートリアルロゴクラスのコンストラクタ
//=============================================================================
CSettai::CSettai() : CGameLogo(6)
{
	// 値をクリア
}

//=============================================================================
// チュートリアルロゴクラスのデストラクタ
//=============================================================================
CSettai::~CSettai()
{
}

//=============================================================================
// チュートリアルロゴ初期化処理
//=============================================================================
HRESULT CSettai::Init(void)
{
	// 2Dオブジェクト初期化処理
	CGameLogo::Init();

	CGameLogo::SetCol(D3DXCOLOR(0.0f, 1.0f, 1.0f, 1.0f));

	return S_OK;
}

//=============================================================================
// チュートリアルロゴ終了処理
//=============================================================================
void CSettai::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CGameLogo::Uninit();
}

//=============================================================================
// チュートリアルロゴ更新処理
//=============================================================================
void CSettai::Update(void)
{
}

//=============================================================================
// チュートリアルロゴ描画処理
//=============================================================================
void CSettai::Draw(void)
{
	//カメラを取得
	CCamera *pCamera = CGame::GetCamera();

	// プレイヤーの状態を取得
	CCamera::STATE CameraState;
	CameraState = pCamera->GetState();

	if (CameraState == CCamera::STATE_NORMAL2)
	{
		// 2Dオブジェクト描画処理
		CGameLogo::Draw();
	}
}

//=============================================================================
// チュートリアルロゴのテクスチャ読み込み処理
//=============================================================================
HRESULT CSettai::Load(void)
{
	// レンダラーを取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = NULL;

	if (pRenderer != NULL)
	{
		pDevice = pRenderer->GetDevice();
	}

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, SETTAI_LOGO_NAME, &m_pTexture);

	return S_OK;
}

//=============================================================================
// チュートリアルロゴのテクスチャ解放処理
//=============================================================================
void CSettai::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}