//=============================================================================
//
// ランキング処理 [ramking.h]
// Author : 竹内亘
//
//=============================================================================
#ifndef _RANKING_H_
#define _RANKING_H_

#include "main.h"

//*****************************************************************************
// クラスの定義
//*****************************************************************************
#define MAX_RANKING (5)

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CRanking
{
public:
	CRanking();
	~CRanking();
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	int m_nTime;		// 遷移するタイミング
	static CScore  * m_apScore[MAX_RANKING];

};

#endif