//=============================================================================
//
// リザルト処理 [result2.h]
// Author : 竹内亘
//
//=============================================================================
#ifndef _RESULT2_H_
#define _RESULT2_H_

#include "main.h"

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CResult2
{
public:
	CResult2();
	~CResult2();
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	static CResult2 * m_pResult;
};

#endif