//=============================================================================
//
// îwåiï`âÊèàóù [bg.h]
// Author : í|ì‡òj
//
//=============================================================================
#ifndef _BG_H_
#define _BG_H_

#include "main.h"

//*****************************************************************************
// ÉvÉçÉgÉ^ÉCÉvêÈåæ
//*****************************************************************************
void InitBG(void);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

//void InitBG02(void);
//void UninitBG02(void);
//void UpdateBG02(void);
//void DrawBG02(void);

#endif