//=============================================================================
//
// 攻撃ゲージ処理 [attackgauge.h]
// Author : Niwa Hodaka
//
//=============================================================================
#ifndef _ATTACKGAUGE_H_
#define _ATTACKGAUGE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define GAUGE_MAX   (700)     // 最大ゲージ

//*****************************************************************************
// 構造体の定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos; // 座標
	D3DXCOLOR col;   // 色
	int ngauge;      // ゲージ
}ATTACKGAUGE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitAttackGauge(void);
void UninitAttackGauge(void);
void UpdateAttackGauge(void);
void DrawAttackGauge(void);
void AddAttackGauge(int gauge);
ATTACKGAUGE *GetAttackGauge(void);

#endif