//=============================================================================
//
// アイテム処理 [item.h]
// Author : Niwa Hodaka
//
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_ITEM	        (256)	 // アイテムの最大数
#define TEXTURE_ITEM_SIZE   (20)     // テクスチャを張り付けるアイテムの高さと幅の大きさ

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;    // 位置
	D3DXVECTOR3 move;   // 移動量
	int nType;          // 種類
	D3DXCOLOR col;      // 色
	bool bUse;          // 使用しているかどうか
	int nCounterState;  // 状態管理のカウンター
}ITEM;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);
void SetItem(D3DXVECTOR3 pos, int nType, D3DXVECTOR3 move);

#endif