//=============================================================================
//
// 残機処理 [remain.h]
// Author : Niwa Hodaka
//
//=============================================================================
#ifndef _REMAIN_H_
#define _REMAIN_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_REMAINNUMBER      (10)       // プレイヤーの残機数の最大

//*****************************************************************************
// 構造体の定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;   // 座標
	bool bUse;         // 使用しているかどうか
}REMAIN;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitRemain(void);
void UninitRemain(void);
void UpdateRemain(void);
void DrawRemain(void);
void SetRemain(int remain);
void AddRemain(void);
void CutRemain(void);

#endif