//=============================================================================
//
// ライト処理 [light.h]
// Author :  Meguro Mikiya
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_LIGHT			(5)	// ライトの最大数

//*********************************************************************
//ライトクラスの定義
//*********************************************************************
class CLight //基本クラス
{
public:
	CLight();
	~CLight();
	void Init(void);
	void Uninit(void);
	void Update(void);
	//メンバ変数
private:
	D3DLIGHT9		m_aLight[MAX_LIGHT];
	D3DXVECTOR3		m_rot;
	int				m_nNumLight;
};

#endif
