//=============================================================================
//
// ライト処理 [light.h]
// Author : Ryo Sugimoto
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"

//*****************************************************************************
// マクロの定義
//*****************************************************************************
#define MAX_LIGHT (3)
//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CLight
{
public:
	CLight();
	~CLight();

	void Init(void);
	void Uninit(void);
	void Update(void); 
	void InitSet(void);
	void Set(void);
	void SetStrength(float fGoal, float fFrame);

private://*****************************************************************************
		//変数宣言//***********************************************************************
	D3DLIGHT9	m_light[MAX_LIGHT];		//ライトの情報
	D3DXCOLOR	m_col;					//ライトの色
	float		m_fStrength;			//ライトの強さ
	float		m_fGoal;				//強さの目標
	float		m_fFrame;				//目標が初期化されるまでのフレーム数
};

#endif
