//=============================================================================
//
// タイトル処理 [Title.cpp]
// Author : Ryo Sugimoto
//
//=============================================================================
#include"Scene.h"
#include"Font.h"
#include "manager.h"
#include "Select.h"
#include "Game.h"
#include "sound.h"

//=============================================================================
// ポリゴンの描画処理
//=============================================================================
HRESULT CSelect::Init(void)
{
	//BGMの再生
	CSound *pSound = CManager::GetSound();
	//pSound->Play(CSound::LABEL_SELECT000);

	return S_OK;
}
//=============================================================================
// ポリゴンの描画処理
//=============================================================================
void CSelect::Update(void)
{
	if (CManager::GetFade().GetState() == CFade::STATE_FADE_NONE)
	{

	}//フェード中でない
}
//=============================================================================
// セレクトの終了処理
//=============================================================================
void	CSelect::Uninit(void)
{
	//BGMの再生
	CSound *pSound = CManager::GetSound();
	//pSound->Stop(CSound::LABEL_SELECT000);
}