//=============================================================================
//
// 結果画面処理 [result.h]
// Author : Niwa Hodaka
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef enum
{
	RESULT_CLEAR = 0,   // ゲームクリア状態
	RESULT_GAMEOVER,    // ゲームオーバー状態
	RESULTMAX
}RESULT;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);
void SetResult(RESULT result);
RESULT GetResult(void);

#endif
